// // Створити змінну з іменем age і присвоїти їй значення свого віку.
// //  Вивести значення цієї змінної в консоль.

// const age = 14;
// console.log(age);

// // Створити змінну з іменем name і присвоїти їй значення свого імені.
// //  Вивести значення цієї змінної в консоль.

// const name = "Nazar";
// console.log(name);   


// // Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом.
// //  Вивести значення цієї змінної в консоль.

// const isStudent = false;
// console.log(isStudent);

// // Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
// //  Вивести цей рядок в консоль.

// const myString = "Если хочешь покупать вещи не смотря на деньги, работай не смотря на время";
// console.log(myString);

// // Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
// //  Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

// const myNumber = 132+10;
// console.log(myNumber);

// // я думаю можна і так і так але на всякий випадок 

// let myNumbers = 130;
// myNumbers += 10;
// console.log(myNumbers);

// // Створити змінну з іменем myNull і присвоїти їй значення null.
// //  Вивести значення цієї змінної в консоль.

// const myNull = null;
// console.log(myNull);


// // Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача “Введіть своє ім’я” за допомогою prompt(). 
// // Результат зберегти в змінній userName. Після вивести alert з отриманим ім’ям. 
// // Також перевірити за допомогою typeof тип змінної userName при отриманні імен. 


// const userName = prompt("Введіть своє ім’я");
// console.log(userName);

// const warn = alert("Ми запам'ятали ваше ім'я:  " + userName);
// console.log(warn);

// console.log(typeof(userName));


// // наче зрозумів задачу так, якщо що напишіть

// // Створити скрипт який виводить спливаюче підтвердження за допомогою confirm() з питання “Ви дійсно хочете покинути сторінку?”.
// //  Результат зберегти в змінній userAnswer та вивести в консоль. Перевірити результат при натисканні ОК та CANCEL

// const userAnswer = confirm("Ви дійсно хочете покинути сторінку");
// console.log("Відповідь користувача:", userAnswer);  

// // Створити скрипт який виводить спливаюче попередження "Увага! Дія може бути небезпечною." за допомогою alert().
// //  Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm() 
// //  “Ви впевнені, що хочете продовжити?”. 

// const warning = alert("Увага! Дія може бути небезпечною");
// console.log(warning);

// const next = confirm("Ви впевнені, що хочете продовжити");
// console.log(next);